{
  "nav": {
    "home": "Inicio",
    "projects": "Proyectos"
  },
  "home": {
    "greeting": "¡Hola! soy",
    "name": "Cristhian",
    "role": "Desarrollador Web",
    "myWork": "Mi trabajo"
  },
  "about": {
    "title": "Sobre mí",
    "description1": "Soy ingeniero en Sistemas Computacionales con más de 3 años de experiencia en desarrollo web. En los últimos 2 años, mi principal enfoque ha sido el desarrollo de productos Front-End.",
    "description2": "Me apasiona transformar ideas en experiencias digitales sólidas y escalables.",
    "downloadCV": "Descargar CV"
  },
  "skills": {
    "title": "Skills",
    "description1": "Cuento con un conjunto integral de habilidades para crear sitios excepcionales y funcionales.",
    "description2": "Me mantengo actualizado con las últimas tendencias y herramientas para ofrecer soluciones innovadoras."
  },
  "projects": {
    "title": "Proyectos",
    "otherProjects": "Otros Proyectos",
    "description1": "He desarrollado proyectos exitosos, desde aplicaciones web sencillas hasta tiendas en línea y CRMs.",
    "description2": "Mis sitios son accesibles y se adaptan a diferentes dispositivos gracias al diseño responsivo.",
    "viewProjects": "Ver Proyectos",
    "readMore": "Leer más",
    "viewCode": "Ver código",
    "viewWebsite": "Ver Sitio Web"
  },
  "contact": {
    "title": "Contacto",
    "description1": "Deseo unirme a un equipo de trabajo motivado donde podamos inspirarnos mutuamente para alcanzar grandes metas.",
    "description2": "Estoy disponible en mi bandeja de entrada para recibir sus mensajes. Si tiene alguna pregunta, no dude en escribirme.",
    "sayHello": "¡Di Hola!"
  },
  "footer": {
    "designedBy": "Diseñado y construido por"
  },
  "slider": {
    "readMore": "Leer más",
    "viewCode": "Código en GitHub",
    "viewWebsite": "Ver Sitio Web",
    "bocados": {
      "title": "Bocados Elite",
      "type": "Desarrollo Fullstack",
      "description": "Quiosco de comida. El diseño elegante y amigable hace que la exploración del menú sea una experiencia agradable y fácil de entender. Implementé un proceso de pedido intuitivo que permite a los usuarios seleccionar sus platos favoritos y personalizar sus órdenes en pocos pasos."
    },
    "guitar": {
      "title": "Guitar los ángeles",
      "type": "Desarrollo Front-End",
      "description": "Tienda online de guitarras. El carrito de compras hace que sea fácil y conveniente agregar guitarras a un pedido, modificar las selecciones y ver el precio total. También ofrece un blog de consejos para ayudar a mejorar las habilidades de tocar la guitarra."
    },
    "barber": {
      "title": "Barber Club",
      "type": "Desarrollo Full-Stack",
      "description": "Aplicación web para reservar citas. Permite a los clientes registrarse, elegir una fecha y hora, y seleccionar los servicios que deseen. Después de crear la cita, los detalles y el costo total se muestran al cliente. La aplicación también permite a los clientes editar o eliminar citas si es necesario. Los administradores pueden crear, editar o eliminar servicios y ver todas las citas del día en una sola vista o buscar una cita por fecha."
    },
    "trago": {
      "title": "Trago Trax",
      "type": "Desarrollo Front-End",
      "description": "Sitio web. Facilita la búsqueda de bebidas y cócteles exquisitos mediante una organización por categorías cuidadosamente seleccionadas. Permitiéndote encontrar las recetas de bebidas perfectas que se ajusten a tus preferencias y necesidades individuales."
    },
    "crm": {
      "title": "Client Connect",
      "type": "Desarrollo Front-End",
      "description": "CRM con una funcionalidad completa de CRUD y una conexión HTTP directa a una API. Permite gestionar clientes con facilidad, asegurando que no se dupliquen registros."
    }
  },
  "layout": {
    "defaultTitle": "Cristhian Sevilla",
    "defaultDescription": "Ingeniero en sistemas computacionales especializado en desarrollo web. Durante los últimos años, mi principal enfoque ha sido el desarrollo de productos Front-End. Me apasiona transformar ideas en experiencias digitales sólidas y escalables."
  },
  "tooltip": {
    "changeLanguage": "Cambia el idioma aquí"
  },
  "otherProjects": {
    "pelis-pulse": {
      "title": "Pelis Pulse",
      "type": "Front-End",
      "description": "Sitio web, facilita la búsqueda de películas clasificadas por géneros, como aventura, terror, etc. Para cada película, se muestra su portada, nombre y fecha de estreno."
    },
    "crypto-check": {
      "title": "Crypto Check",
      "type": "Front-End",
      "description": "Aplicación web, cotiza en tiempo real el precio de las 20 Criptomonedas con más valor o capitalización en el mercado. Para usarla, elige una moneda o divisa y una criptomoneda y haz clic en cotizar."
    },
    "auto-seguro": {
      "title": "Auto Seguro",
      "type": "Front-End",
      "description": "Aplicación web. Simula la cotización de seguros para automóviles, brinda la oportunidad de obtener una cotización, considerando diversos factores como la diferencia de años, la marca de tu vehículo y el plan de seguro que se elija"
    },
    "bienes-raices": {
      "title": "Bienes Raíces",
      "type": "FullStack",
      "description": "Sitio web con anuncios de casas en venta, el usuario tiene la oportunidad de pedir información sobre una propiedad en venta o para publicar un anuncio de su propiedad en venta. El sitio también cuenta con un blog de consejos y una sección de testimoniales. El administrador tiene todo el control sobre anuncios, vendedores y posts."
    },
    "weather-finder": {
      "title": "Clima Now",
      "type": "Front-End",
      "description": "Aplicación web. Proporciona información sobre las condiciones climáticas de varias ubicaciones."
    },
    "plan-gastos": {
      "title": "Plan Gastos",
      "type": "Front-End",
      "description": "Aplicación web que ayuda a sus usuarios a llevar un seguimiento de sus gastos. Tiene la capacidad de agregar y editar gastos con facilidad y la función de filtrar los gastos por categorías, además de una gráfica que se actualizan automáticamente dependiendo del presupuesto gastado."
    },
    "cafe-adicto": {
      "title": "Café Adicto",
      "type": "Front-End",
      "description": "Este sitio web es un paraíso para los amantes del café, donde podrán encontrar todo lo que necesitan saber sobre este maravilloso mundo y sumergirse en sus colores, aromas y sabores."
    },
    "healthy-pets": {
      "title": "Healthy Pets",
      "type": "Front-End",
      "description": "Aplicación web para realizar un seguimiento de la información médica y de salud de las mascotas de sus clientes de manera organizada y fácil."
    },
    "emfestival": {
      "title": "EMFestival",
      "type": "Front-End",
      "description": "Landing Page con la finalidad de brindar información acerca del evento. La primera impresión al entrar a la página es transmitir a través de un video de fondo la emoción de vivir la experiencia de estar presente el día del evento."
    }
  }
}