{
  "nav": {
    "home": "Home",
    "projects": "Projects"
  },
  "home": {
    "greeting": "Hello! I'm",
    "name": "Cristhian",
    "role": "Software Engineer",
    "myWork": "My Work"
  },
  "about": {
    "title": "About Me",
    "description1": "Software engineer with +4 years turning ideas into digital solutions: from modern interfaces to backend that makes working with large volumes of data efficient.",
    "description2": "I'm passionate about shaping projects that make a difference, combining technique and exceptional experiences. For me, code doesn't just solve problems, it also opens possibilities.",
    "downloadCV": "Download CV"
  },
  "skills": {
    "title": "Skills",
    "description1": "I enjoy tackling complex problems with an analytical approach, designing digital solutions that are efficient and scalable.",
    "description2": "I enjoy collaborating in multidisciplinary teams, where communication and teamwork enhance projects. Always learning and innovating to ensure quality in every development."
  },
  "experience": {
    "title": "Experience",
    "exos": {
      "period": "Sept 2023 – Present · Remote",
      "company": "Exos Technology",
      "backend": {
        "role": "Backend Developer",
        "description1": "Batch processes with Java 21 / Spring Batch for financial reconciliation and ETL in SQL Server / Informix.",
        "description2": "Job and query optimization, increasing efficiency by 40%.",
        "description3": "Automation of massive file import and export."
      },
      "frontend": {
        "role": "Frontend Developer",
        "description1": "Banking application (eGlobal) with Vue.js, Tailwind CSS, Pinia and Vuetify.",
        "description2": "Migration from monolith to micro frontends, improving modularity by 25%.",
        "description3": "REST API integration, reducing loading times by 15%.",
        "description4": "Creation of reusable components with i18n support and functional validation."
      }
    },
    "freelance": {
      "period": "Jan 2021 – Jun 2024",
      "company": "Freelance",
      "role": "Full Stack Developer",
      "description1": "Construction of E-Commerce platforms and web applications with Vue 3, React and Next.js.",
      "description2": "Development of custom dashboards with React, Tailwind CSS and Vuetify, using Hooks and Context API.",
      "description3": "Integration of REST APIs and state management with Pinia and Vuex."
    }
  },
  "projects": {
    "title": "Projects",
    "otherProjects": "Other Projects",
    "description1": "I have developed successful projects, from simple web applications to online stores and CRMs.",
    "description2": "My sites are accessible and adapt to different devices thanks to responsive design.",
    "viewProjects": "View Projects",
    "readMore": "Read more",
    "viewCode": "View Code",
    "viewWebsite": "View Website"
  },
  "contact": {
    "title": "Contact",
    "description1": "I'm interested in collaborating with motivated teams, where we can innovate and grow together developing impactful technological solutions.",
    "description2": "If you have any questions, proposals, or simply want to connect, I'll be delighted to receive your message.",
    "sayHello": "Say Hello!"
  },
  "footer": {
    "designedBy": "Designed and built by"
  },
  "slider": {
    "readMore": "Read more",
    "viewCode": "GitHub Code",
    "viewWebsite": "View Website",
    "bocados": {
      "title": "Bocados Élite",
      "type": "Digital Kiosk Fullstack",
      "description": "Self-service kiosk with 3-step checkout flow. Dynamic cart and admin panel with real-time updates every 3 seconds.",
      "imageAlt": "Screenshot of Bocados Élite application showing the digital kiosk interface"
    },
    "guitar": {
      "title": "Guitar Los Angeles",
      "type": "Front-End Development",
      "description": "Online guitar store. The shopping cart makes it easy and convenient to add guitars to an order, modify selections and see the total price. It also offers a tips blog to help improve guitar playing skills.",
      "imageAlt": "Screenshot of Guitar Los Angeles online store showing the guitar catalog"
    },
    "barber": {
      "title": "Barber Club",
      "type": "Full-Stack Development",
      "description": "Web application for booking appointments. It allows clients to register, choose a date and time, and select the services they want. After creating the appointment, the details and total cost are shown to the client. The application also allows clients to edit or delete appointments if necessary. Administrators can create, edit or delete services and view all appointments for the day in a single view or search for an appointment by date.",
      "imageAlt": "Screenshot of Barber Club application showing the appointment booking system"
    },
    "trago": {
      "title": "Trago Trax",
      "type": "Front-End Development",
      "description": "Website. It facilitates the search for exquisite drinks and cocktails through carefully selected category organization. Allowing you to find the perfect drink recipes that suit your individual preferences and needs.",
      "imageAlt": "Screenshot of Trago Trax website showing the drinks and cocktails catalog"
    },
    "crm": {
      "title": "Client Connect",
      "type": "Front-End Development",
      "description": "CRM with full CRUD functionality and direct HTTP connection to an API. It allows managing clients with ease, ensuring that records are not duplicated.",
      "imageAlt": "Screenshot of Client Connect CRM showing the client management interface"
    }
  },
  "layout": {
    "defaultTitle": "Cristhian Sevilla",
    "defaultDescription": "Computer Systems Engineer specialized in web development. In recent years, my main focus has been Front-End product development. I am passionate about transforming ideas into solid and scalable digital experiences."
  },
  "tooltip": {
    "changeLanguage": "Change language here"
  },
  "otherProjects": {
    "pelis-pulse": {
      "title": "Pelis Pulse",
      "type": "Front-End",
      "description": "Website that facilitates the search for movies classified by genres, such as adventure, horror, etc. For each movie, its cover, name and release date are shown."
    },
    "crypto-check": {
      "title": "Crypto Check",
      "type": "Front-End",
      "description": "Web application that quotes in real time the price of the 20 Cryptocurrencies with the highest value or market capitalization. To use it, choose a currency and a cryptocurrency and click quote."
    },
    "auto-seguro": {
      "title": "Auto Insurance",
      "type": "Front-End",
      "description": "Web application. Simulates car insurance quotes, provides the opportunity to get a quote, considering various factors such as the age difference, your vehicle brand and the insurance plan you choose"
    },
    "bienes-raices": {
      "title": "Real Estate",
      "type": "FullStack",
      "description": "Website with house sale ads, the user has the opportunity to request information about a property for sale or to publish an ad for their property for sale. The site also has a tips blog and a testimonials section. The administrator has full control over ads, sellers and posts."
    },
    "weather-finder": {
      "title": "Weather Now",
      "type": "Front-End",
      "description": "Web application. Provides information about weather conditions in various locations."
    },
    "plan-gastos": {
      "title": "Expense Planner",
      "type": "Front-End",
      "description": "Web application that helps users track their expenses. It has the ability to add and edit expenses easily and the function to filter expenses by categories, plus a chart that updates automatically depending on the budget spent."
    },
    "cafe-adicto": {
      "title": "Coffee Addict",
      "type": "Front-End",
      "description": "This website is a paradise for coffee lovers, where they can find everything they need to know about this wonderful world and immerse themselves in its colors, aromas and flavors."
    },
    "healthy-pets": {
      "title": "Healthy Pets",
      "type": "Front-End",
      "description": "Web application to track medical and health information of their clients' pets in an organized and easy way."
    },
    "emfestival": {
      "title": "EMFestival",
      "type": "Front-End",
      "description": "Landing Page with the purpose of providing information about the event. The first impression when entering the page is to transmit through a background video the emotion of living the experience of being present on the day of the event."
    }
  }
}
